controllers/SiteController.php

    public function actionCreate()
    {
        $model = new Phonebook();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `phonebook` (`name`, `surname`, `patronymic`, `date`) VALUES ('123123', '3212313', '1232311232123', '19-12-16')

    public function actionUpdatenumber($id) {

        $model = Phone::findOne($id);
        $name = Phonebook::findOne($model->id_phonbook)->name;// имя для хлебных крошек

         if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
SELECT * FROM `phonebook` WHERE `id_phonbook`=16
SELECT EXISTS(SELECT * FROM `phonebook` WHERE `id_phonbook`='14')

     public function actionAddnumber($id)// для вывода крошек надо было б пириписать этот класс но так как уже час ночи отсылаю таким ))
    {
        $model = new Phone();
        $count= $model->find()->where(['id_phonbook' => $id])->count();

        if ($count < 10){



        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
SELECT COUNT(*) FROM `phone` WHERE `id_phonbook`='16'
INSERT INTO `phone` (`number`, `id_phonbook`) VALUES ('1231231231', 16)